<script setup>
import ServerHistory from "@/components/ServerHistory.vue";
</script>

<template>
  <div>
    <h1>История Рарамура</h1>
    <ServerHistory name="Raramur Original" version="1.14.x" timespan="01.07.19 - 21.11.19">
      <p>
        Сервер, на котором впервые прозвучало название "Рарамур". Интересный факт: на открытии это был очередной сервер
        для подписчиков, но спустя уже пару дней в группе ВКонтакте появился пост с объявлением конкурса на название
        сервера.
      </p>
      <p>
        По результатам голосования победил вариант "FiftyFive", но настырность и убежденность в гениальности своего
        названия другого участника конкурса привели к решению провести опрос только среди тех, кто действительно играет
        на сервере, а не всех участников группы.
      </p>
      <p>
        Для многих этот сервер имеет статус культового: именно здесь был построен мост в никуда, огромное поле для
        первой неудавшейся попытки сбора миллиона пшеницы, лорный город в пустыне и множество других, не таких же
        глобальных, но запоминающихся объектов.
      </p>
    </ServerHistory>
    <ServerHistory name="Raramur Realms" version="1.14.x" timespan="26.11.19 - 09.12.19">
      <p>
        Первый и единственный сервер в системе Realms. Тут и говорить нечего, просто посмотрите на этого снеговика:
      </p>
    </ServerHistory>
    <ServerHistory name="Raramur v2.0" version="1.15.2" timespan="11.12.19 - 04.04.20" save="raramur_v2_1.15.2">
      <p>
        Тот самый сервер, где наконец-то был собран миллион пшеницы! Помимо этого там были небольшая деревня на болоте,
        мемориал Windows 7, Шкаф и, конечно же, пчёлки.
      </p>
    </ServerHistory>
    <ServerHistory name="Raramur v2.5" version="1.16.1" timespan="23.06.20 - 21.08.20" save="raramur_v2.5_1.16.1">
      <p>
        Непопулярный среди активных игроков сервер, из примечательного только проекты Антошки: дом в аду и Stride
        Racing.
      </p>
    </ServerHistory>
    <ServerHistory version="1.16.2" timespan="26.08.20 - 01.10.20">
      <p>
        Об этом сервере известно только то, что добавление в вайтлист происходило по заявкам. Для сбора заявок был
        разработан сайт, который сохранился в памяти - как человеческой, так и компьютерной, - в отличие от каких-либо
        других воспоминаний о сервере.
      </p>
    </ServerHistory>
    <ServerHistory name="Raramur Reborn" version="1.16.5" timespan="11.01.21 - 03.07.21" save="raramur_reborn_1.16.5">
      <p>
        Второй по культовости Рарамур. Практически все игроки объединились на одном проекте: городе, который скорее
        напоминал деревню. В городе были библиотека, банк, офис компании СКД, ресторан, супермаркет.
      </p>
      <p>
        Ярким событием стал праздник на площади с конкурсом чашек, мини-концертом и фейерверками.
      </p>
      <p>
        Специально для этого сервера были разработаны датапак и ресурпак, которые добавляли в игру монеты и банкоматы.
      </p>
    </ServerHistory>
    <ServerHistory name="Raramur v3.0" version="1.17.1" timespan="18.07.21 -  29.11.21" save="raramur_v3_1.17.1">
      <p>
        Сервер без отображения координат и, на первое время, без Энда. Интересный факт: хотя ориентироваться в
        пространстве стало сложнее, это не помешало игрокам разбрестись по всему миру. Возможно, попытка отдохнуть от
        совместного города в прошлом сезоне...
      </p>
      <p>
        На этом сервере были построены такие проекты как Raramurland, адронный коллайдер (по плану внутри должна была
        крутиться жаба), уютный спавн с магазином и обустроенной набережной.
      </p>
    </ServerHistory>
    <ServerHistory name="Raramur Ascended" version="1.19.2" timespan="10.12.21 - 08.01.23"
                   save="raramur_ascended_1.19.2">
      <p>
        Этот сервер вновь попытался объединить игроков: по плану, общим проектом должен был стать город в горе - в тему
        нового обновления. Частично проект можно считать выполненным, так как большинство игроков жили у высокой горы на
        спавне. Однако городом данную общину назвать трудно - это больше походило на выставку скульптур и арт-объектов.
      </p>
      <p>
        Но на этом сходства с "городским" сезоном не заканчиваются, ведь и в этом случае был проведён праздник - "Тайный
        Санта". В этом ивенте поучаствовали практически все игроки - всё благодаря Антошке, который активно продвигал
        его и привлекал как можно больше участников.
      </p>
    </ServerHistory>
    <ServerHistory name="Raramur In a Jar" version="1.18.2" timespan="08.01.23 - 20.01.23"
                   save="raramur_in-a-jar_1.18.2">
      <p>
        Первый сервер на предварительно созданной карте. Хотя это всё ещё был ванильный сервер, Рарамур впервые ощутил
        на себе настоящий эксперимент. Всё-таки игра в полноценном мире, хоть и с необычными правилами или даже
        датапаками, сильно отличается от игры в ограниченном пространстве - в данном случае, в банках.
      </p>
    </ServerHistory>
    <ServerHistory name="Raramur: All of Fabric 6" version="1.19.2" timespan="13.02.23 - 26.04.23"
                   save="raramur_all-of-fabric-6_1.19.2">
      <p>
        Первый модный (с модами) сервер в истории Рарамура. Не обрёл большой популярности среди игроков, но показал
        новые перспективы для сервера. Теперь сезоны могут не только поощрять креатив игроков в ванильной игре, но и
        ставить перед собой цель пройти какой-нибудь модпак.
      </p>
    </ServerHistory>
    <ServerHistory name="Raramur Raft" version="1.17.1" timespan="26.08.23 - 31.08.23" save="raramur_raft_1.17.1">
      <p>
        По факту однодневный сервер на карте в стиле игры Raft, "комната ожидания" следующего сезона. Тем не менее,
        игроки успели проявить себя:
      </p>
    </ServerHistory>
  </div>
</template>

<style scoped>

</style>